use K_MyBase;

DECLARE @savepoint varchar(30);
begin try
	begin tran
		delete КОНТАКТЫ where Контактное_лицо ='Тим Кук';									set @savepoint = 'save1'; save tran @savepoint;
		INSERT into КОНТАКТЫ values('Тим Бук','Apple','8002752273');							set @savepoint = 'save2'; save tran @savepoint;
		update КОНТАКТЫ set Контактное_лицо = 'Тим Кук' where Контактное_лицо='Тим Бук';		set @savepoint = 'save3'; save tran @savepoint;
	commit tran;
end try
begin catch
	print 'Ошибка: ' + cast(error_number() as varchar(5)) + ' ' + error_message()
	if @@TRANCOUNT > 0
		begin
			print 'Контрольная точка: ' + @savepoint;
			rollback tran @savepoint;
			commit tran;
		end;
end catch;	

--***************************************************************************
INSERT into КОНТАКТЫ values('Тим Кук','Apple','8002752273');
-- ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬

-- A ---
	set transaction isolation level READ UNCOMMITTED 
	begin transaction 
	-------------------------- t1 ------------------
	select @@SPID 'SID', 'insert КОНТАКТЫ' 'результат', * from КОНТАКТЫ 
	                                                                where Контактное_лицо='Тим Кук';
																	             
	select @@SPID 'SID', 'update ОТЧЁТЫ'  'результат',  НОМЕР_ОТЧЁТА, 
                      Дата_отчёта,Название_предприятия, Название_показателя, Значение_показателя from ОТЧЁТЫ  
					  where  Дата_отчёта='16/05/22';
	commit; 
	-------------------------- t2 -----------------

--- B --	
	begin transaction 
	select @@SPID 'SID';
	INSERT into КОНТАКТЫ values('Тим Кук','Apple','8002752273');
	update ОТЧЁТЫ set Дата_отчёта = '16/05/22' where Дата_отчёта='16/05/21';	
	-------------------------- t1 --------------------
	-------------------------- t2 --------------------
	rollback;

--***************************************************************************
	delete КОНТАКТЫ where Контактное_лицо='Тим Кук';
-- ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬

-- A ---
    set transaction isolation level READ COMMITTED 
	begin transaction 
	select count(*) from ОТЧЁТЫ  where Дата_отчёта='16/05/22';
	-------------------------- t1 ------------------ 
	-------------------------- t2 -----------------
	select @@SPID 'SID', 'update ОТЧЁТЫ'  'результат',  НОМЕР_ОТЧЁТА, 
                      Дата_отчёта,Название_предприятия, Название_показателя, Значение_показателя from ОТЧЁТЫ  
					  where  Дата_отчёта='16/05/21';
	commit; 

	--- B ---	
	begin transaction 	  
	-------------------------- t1 --------------------
    update ОТЧЁТЫ set Дата_отчёта = '16/05/21' where Дата_отчёта='16/05/22';	

      commit; 
	-------------------------- t2 --------------------	

-- ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬

-- A ---
    set transaction isolation level  REPEATABLE READ 
	begin transaction 
	select Контактное_лицо from КОНТАКТЫ where Контактное_лицо = 'Тим Кук';
	-------------------------- t1 ------------------ 
	-------------------------- t2 -----------------
	select  case
          when Контактное_лицо = 'Тим Кук' then 'insert  SUBJECT'  else ' ' 
end 'результат', Название_предприятия from КОНТАКТЫ;
	commit; 

	--- B ---	
	begin transaction 	  
	-------------------------- t1 --------------------
          	INSERT into КОНТАКТЫ values('Тим Кук','Apple','8002752273');  
          commit; 
	-------------------------- t2 --------------------

--***************************************************************************
	delete КОНТАКТЫ where Контактное_лицо='Тим Кук';
-- ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬

--								ЗАДАНИЕ 7

-- ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬

-- A ---
set transaction isolation level SERIALIZABLE 
	begin transaction 
		delete КОНТАКТЫ where Контактное_лицо ='Тим Кук';									
		INSERT into КОНТАКТЫ values('Тим Бук','Apple','8002752273');							
		update КОНТАКТЫ set Контактное_лицо = 'Тим Кук' where Контактное_лицо='Тим Бук';	
	    select * from КОНТАКТЫ  where Контактное_лицо='Тим Кук';
	-------------------------- t1 -----------------
	    select * from КОНТАКТЫ  where Контактное_лицо='Тим Кук';
	-------------------------- t2 ------------------ 
	commit; 	

--- B ---	
	begin transaction 	  
		delete КОНТАКТЫ where Контактное_лицо ='Тим Кук';									
		INSERT into КОНТАКТЫ values('Тим Бук','Apple','8002752273');							
		update КОНТАКТЫ set Контактное_лицо = 'Тим Кук' where Контактное_лицо='Тим Бук';	
	    select * from КОНТАКТЫ  where Контактное_лицо='Тим Кук';
     -------------------------- t1 --------------------
     commit; 
     	    select * from КОНТАКТЫ  where Контактное_лицо='Тим Кук';
     -------------------------- t2 --------------------

--***************************************************************************		
	delete КОНТАКТЫ where Контактное_лицо='Тим Кук';
-- ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬

--								ЗАДАНИЕ 8


begin tran
		INSERT into КОНТАКТЫ values('Тим Бук','Apple','8002752273');	
		begin tran
		update КОНТАКТЫ set Контактное_лицо = 'Тим Кук' where Контактное_лицо='Тим Бук';	
		commit
		if @@TRANCOUNT > 0 rollback;

select
		(select count(*) from КОНТАКТЫ  where Контактное_лицо='Тим Кук') 'Контакты',
		(select count(*) from КОНТАКТЫ inner join ПРЕДПРИЯТИЯ on КОНТАКТЫ.Название_предприятия = КОНТАКТЫ.Название_предприятия) 'Предприятия'