use KOVALEV_UNIVER

--CREATE table STUDENTS
--(
--	[Номер зачётки] nvarchar(6) primary key,
--	[ФИО] nvarchar(50),
--	[Дата рождения] date check([Дата рождения] Between '01.01.1995' AND '01.01.2004'),
--	[Пол] nchar(1) default 'М' check ([Пол] in ('М', 'Ж')),
--	[Дата поступления] date check([Дата поступления] Between '01.01.2015' AND '01.01.2021')
--)

--INSERT into STUDENTS 
--VALUES ('123456','Ковалев Александр Александрович','09/04/2002','М','01/09/2019'),
--('456787','Качанова Анастасия Сергеевна','09/04/2001','Ж','20/09/2018'),
--('546385','Ерчинская Наталья Дмитриевна','05/03/2000','Ж','12/08/2017'),
--('764894','Астапкина Екатерина Сергеевна','30/02/1999','Ж','01/09/2020'),
--('234567','Пятинкина Анита Алексеевна','05/12/2008','Ж','01/09/2019')

SELECT * from STUDENTS where (YEAR([Дата поступления]) - YEAR([Дата рождения]) >= '18') AND  [Пол] = 'Ж';