use K_UNIVER;

INSERT into TIMETABLE(DAYWEEK,IDGROUP,[SUBJECT],AUDITORIUM,TEACHER,CLASS)
VALUES
('Понедельник',22,'БД','320-4','СМЛВ','8:00'),
('Понедельник',22,'ПСП','413-1','РМНВ','9:50'),
('Понедельник',22,'ПИС','324-1','МРЗВ','13:50'),

('Понедельник',23,'ПИС','320-4','МРЗВ','8:00'),
('Понедельник',23,'СУБД','314-4','КРЛВ','9:50'),
('Понедельник',23,'ПСП','413-1','РМНВ','11:40'),
('Понедельник',23,'БД','320-4','СМЛВ','13:50'),

('Вторник',22,'СУБД','314-4','КРЛВ','11:40'),
('Вторник',22,'ОАиП','320-4','БЛД','13:50'),
('Вторник',22,'ОАиП','320-4','БЛД','8:00'),

('Вторник',23,'ООТП','320-4','ПЦЙ','9:50'),
('Вторник',23,'ОАиП','320-4','БЛД','11:40');
